#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
// 	// “~” 按（2进制）位取反
//	int a = 0;//4个字节 32个bit位
//	//0000000000000000000000
//	int b = ~a;// b 是有符号的整型
//	//11111111111111111111111
//	//负数再内存中存储的时候，存储的是二进制的补码
//	//补码——1111111111111111111111
//	//反码——1111111111111111111110
//	//原码——1000000000000000000001
//	printf("%d\n", b);//打印的是这个数的原码
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = a++;// 后置++ —— 先使用，再自增(++)
//	int c = ++a;// 前置++ —— 先自增(++)，再使用
//	// “++”“--” 用法相同
//	printf("a = %d b = %d c = %d\n", a, b, c);
//	return 0;
//}

//int main()
//{
//	int a = (int)3.14;// double-->int 强制类型转换
//
//	return 0;
//}

//int main()
//{
//	// 真 —— 非0
//	// 假 —— 0
//	// && —— 逻辑与
//	// || —— 逻辑或
//	int a = 0;
//	int b = 5;
//	int c = a && b;
//	int d = a || b;
//	printf("c = %d\n", c);
//	printf("d = %d\n", d);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = 20;
//	int max = 0;
//	//三目操作符 —— 三个操作数
//	max = (a > b ? a : b);
//	/*if (a > b)
//		max = a;
//	else
//		max = b;*/
//	return 0;
//}


//int Add(int x, int y)
//{
//	int z = 0;
//	z = x + y;
//	return z;
//}
//int main()
//{
////	int arr[10] = { 0 };
////	arr[4];// “[]” —— 下标引用操作符
//	int a = 10;
//	int b = 20;
//	int sum = Add(a, b);//（） —— 函数调用操作符
//	return 0;
//}

//只要是整数，内存中存储的都是二进制的补码
//整数 —— 原码，反码，补码 相同
//负数 ——
//原码 ：直接按照正负写出的二进制序列
//反码 ：原码符号位不变，其他位按位取反
//补码 ：反码+1