#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	int a = 5 % 2;//取模
//	printf("%d\n", a);
//	return 0;
//}

//int main()
//{
//	//移（2进制）位操作符
//	//<<左移
//	//>>右移
//	int a = 1;
//	//整型1占4个字节 = 32bit位数
//	//00000000000000000000000000000001
//	int b = a<<1;
//	printf("%d\n", b);
//	//00000000000000000000000000000010
//	return 0;
//}
//
//int main()
//{
//	//(2进制)位操作
//	//& 按位 与
//	//| 按位 或
//	//^ 按位 异或
//	int a = 3;
//	int b = 5;
//	int c = a & b;// 与 —— 对应的2进制位 有0则为0 都1才为1
//	// a 011
//	// b 101
//	// c 001
//	printf("%d\n", c);
//	int d = a | b;// 或 —— 对应的2进制位 有1则为1 都0才为0
//	// a 011
//	// b 101
//	// d 111
//	printf("%d\n", d);
//	int e = a ^ b;// 异或 —— 对应的2进制位 相同为0 相异为1
//	// a 011
//	// b 101
//	// e 110
//	printf("%d\n", e);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	//赋值操作符 =      （==判断相等）
//	a = 20;
//	a = a + 10;
//	a += 10;
//	a = a - 20;
//	a -= 20;
//	a = a & 20;
//	a &= 20;
//	//复合赋值符
//	// += -= *= /= %= >>= <<= &= |= ^=
//	return 0;
//}