#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	int a = 0;//4个字节 32个bit位
//	//0000000000000000000000
//	int b = ~a;// b 是有符号的整型
//	//11111111111111111111111
//	//负数再内存中存储的时候，存储的是二进制的补码
//	//补码——1111111111111111111111
//	//反码——1111111111111111111110
//	//原码——1000000000000000000001
//	printf("%d\n", b);//打印的是这个数的原码
//	// “~” 按（2进制）位取反
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = a++;// 后置++ —— 先使用，再自增(++)
//	int c = ++a;// 前置++ —— 先自增(++)，再使用
//	// “++”“--” 用法相同
//	printf("a = %d b = %d c = %d\n", a, b, c);
//	return 0;
//}